# 1. Биринчи функция (Календарь)
def show_calendar():
    print("\n--- SmartManager Календары ---")
    print("Бүгүнкү дата: 2024-жыл, 22-май")
    print("Жакынкы иш-чаралар: Лабораториялык ишти тапшыруу.")

# 2. Экинчи функция (Жашты суроо - жаңы кошулганы)
def get_user_age():
    try:
        age = int(input("Жашыңызды киргизиңиз: "))
        print(f"Сиздин жашыңыз: {age}")
    except ValueError:
        print("Ката! Сураныч, тамга эмес, бир гана сан киргизиңиз.")

# 3. Эң аягында - СТАРТ БЛОГУ (ушул жерден чакырасыз)
if __name__ == "__main__":
    show_calendar() # биринчи календарь чыгат
    get_user_age()  # андан кийин жашты сурайт